; ModuleID = '401.bzip2.bc'

; RUN: llvm-as %s -o %t.bc 
; RUN: llvm-epp %t.bc -o %t.profile
; RUN: clang -v %t.epp.bc -o %t-exec -lepp-rt 2> %t.compile 
; RUN: %t-exec > %t.log
; RUN: llvm-epp -p=%t.profile %t.bc 2> %t.decode

target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.spec_fd_t = type { i32, i32, i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.EState = type { %struct.bz_stream*, i32, i32, i32, i32*, i32*, i32*, i32, i32*, i8*, i16*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], [256 x i8], i32, i32, i32, i32, i32, i32, i32, i32, [258 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [258 x [4 x i32]] }
%struct.bz_stream = type { i8*, i32, i32, i32, i8*, i32, i32, i32, i8*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8* }
%struct.UInt64 = type { [8 x i8] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !9, globals: !52)
!1 = !DIFile(filename: "spec.c", directory: "/p-ssd/amoeba/shared/bench/SPEC2006-Install/benchspec/CPU2006/401.bzip2/run/build_base_amd64-m64-clang-nn.0001")
!2 = !{}
!3 = !{!4, !5, !7, !8}
!4 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !{!10, !14, !17, !20, !25, !28, !31, !32, !35, !36, !37, !38, !39, !40, !44, !47, !50, !51}
!10 = distinct !DISubprogram(name: "ran", scope: !1, file: !1, line: 53, type: !11, isLocal: false, isDefinition: true, scopeLine: 63, isOptimized: false, variables: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{!13}
!13 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!14 = distinct !DISubprogram(name: "spec_init", scope: !1, file: !1, line: 80, type: !15, isLocal: false, isDefinition: true, scopeLine: 80, isOptimized: false, variables: !2)
!15 = !DISubroutineType(types: !16)
!16 = !{!8}
!17 = distinct !DISubprogram(name: "spec_random_load", scope: !1, file: !1, line: 103, type: !18, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!18 = !DISubroutineType(types: !19)
!19 = !{!8, !8}
!20 = distinct !DISubprogram(name: "spec_load", scope: !1, file: !1, line: 132, type: !21, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!21 = !DISubroutineType(types: !22)
!22 = !{!8, !8, !23, !8}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!25 = distinct !DISubprogram(name: "spec_read", scope: !1, file: !1, line: 164, type: !26, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!26 = !DISubroutineType(types: !27)
!27 = !{!8, !8, !5, !8}
!28 = distinct !DISubprogram(name: "spec_fread", scope: !1, file: !1, line: 185, type: !29, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!29 = !DISubroutineType(types: !30)
!30 = !{!8, !5, !8, !8, !8}
!31 = distinct !DISubprogram(name: "spec_getc", scope: !1, file: !1, line: 206, type: !18, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!32 = distinct !DISubprogram(name: "spec_ungetc", scope: !1, file: !1, line: 221, type: !33, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!33 = !DISubroutineType(types: !34)
!34 = !{!8, !6, !8}
!35 = distinct !DISubprogram(name: "spec_rewind", scope: !1, file: !1, line: 239, type: !18, isLocal: false, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!36 = distinct !DISubprogram(name: "spec_reset", scope: !1, file: !1, line: 243, type: !18, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!37 = distinct !DISubprogram(name: "spec_write", scope: !1, file: !1, line: 249, type: !26, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!38 = distinct !DISubprogram(name: "spec_fwrite", scope: !1, file: !1, line: 261, type: !29, isLocal: false, isDefinition: true, scopeLine: 261, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!39 = distinct !DISubprogram(name: "spec_putc", scope: !1, file: !1, line: 273, type: !33, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!40 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 286, type: !41, isLocal: false, isDefinition: true, scopeLine: 286, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!41 = !DISubroutineType(types: !42)
!42 = !{!8, !8, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!44 = distinct !DISubprogram(name: "spec_initbufs", scope: !1, file: !1, line: 388, type: !45, isLocal: false, isDefinition: true, scopeLine: 388, isOptimized: false, variables: !2)
!45 = !DISubroutineType(types: !46)
!46 = !{null}
!47 = distinct !DISubprogram(name: "spec_compress", scope: !1, file: !1, line: 396, type: !48, isLocal: false, isDefinition: true, scopeLine: 396, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !8, !8, !8}
!50 = distinct !DISubprogram(name: "spec_uncompress", scope: !1, file: !1, line: 400, type: !48, isLocal: false, isDefinition: true, scopeLine: 400, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!51 = distinct !DISubprogram(name: "debug_time", scope: !1, file: !1, line: 408, type: !15, isLocal: false, isDefinition: true, scopeLine: 408, isOptimized: false, variables: !2)
!52 = !{!53, !54, !64}
!53 = !DIGlobalVariable(name: "dbglvl", scope: !0, file: !1, line: 28, type: !8, isLocal: false, isDefinition: true, variable: i32* @dbglvl)
!54 = !DIGlobalVariable(name: "spec_fd", scope: !0, file: !1, line: 50, type: !55, isLocal: false, isDefinition: true, variable: [3 x %struct.spec_fd_t]* @spec_fd)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 576, align: 64, elements: !62)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "spec_fd_t", file: !1, line: 45, size: 192, align: 64, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !56, file: !1, line: 46, baseType: !8, size: 32, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !56, file: !1, line: 47, baseType: !8, size: 32, align: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !56, file: !1, line: 48, baseType: !8, size: 32, align: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !56, file: !1, line: 49, baseType: !5, size: 64, align: 64, offset: 128)
!62 = !{!63}
!63 = !DISubrange(count: 3)
!64 = !DIGlobalVariable(name: "seedi", scope: !0, file: !1, line: 52, type: !65, isLocal: false, isDefinition: true, variable: i64* @seedi)
!65 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!66 = distinct !DICompileUnit(language: DW_LANG_C99, file: !67, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !68, subprograms: !78, globals: !188)
!67 = !DIFile(filename: "blocksort.c", directory: "/p-ssd/amoeba/shared/bench/SPEC2006-Install/benchspec/CPU2006/401.bzip2/run/build_base_amd64-m64-clang-nn.0001")
!68 = !{!69, !4, !73, !74, !75, !70, !76, !77}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !71, line: 87, baseType: !72)
!71 = !DIFile(filename: "./bzlib_private.h", directory: "/p-ssd/amoeba/shared/bench/SPEC2006-Install/benchspec/CPU2006/401.bzip2/run/build_base_amd64-m64-clang-nn.0001")
!72 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !71, line: 83, baseType: !6)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !71, line: 84, baseType: !8)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !71, line: 82, baseType: !6)
!77 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!78 = !{!79, !167, !170, !173, !174, !178, !181, !182, !185}
!79 = distinct !DISubprogram(name: "BZ2_blockSort", scope: !67, file: !67, line: 1078, type: !80, isLocal: false, isDefinition: true, scopeLine: 1079, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !71, line: 300, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 231, size: 446144, align: 64, elements: !85)
!85 = !{!86, !110, !111, !112, !114, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !137, !139, !140, !141, !142, !143, !144, !145, !146, !147, !151, !155, !156, !160, !162, !163}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !84, file: !71, line: 233, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !89, line: 221, baseType: !90)
!89 = !DIFile(filename: "./bzlib.h", directory: "/p-ssd/amoeba/shared/bench/SPEC2006-Install/benchspec/CPU2006/401.bzip2/run/build_base_amd64-m64-clang-nn.0001")
!90 = !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 204, size: 640, align: 64, elements: !91)
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !105, !109}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !90, file: !89, line: 205, baseType: !23, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !90, file: !89, line: 206, baseType: !77, size: 32, align: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !90, file: !89, line: 207, baseType: !77, size: 32, align: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !90, file: !89, line: 208, baseType: !77, size: 32, align: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !90, file: !89, line: 210, baseType: !23, size: 64, align: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !90, file: !89, line: 211, baseType: !77, size: 32, align: 32, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !90, file: !89, line: 212, baseType: !77, size: 32, align: 32, offset: 288)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !90, file: !89, line: 213, baseType: !77, size: 32, align: 32, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !90, file: !89, line: 215, baseType: !7, size: 64, align: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !90, file: !89, line: 217, baseType: !102, size: 64, align: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!7, !7, !8, !8}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !90, file: !89, line: 218, baseType: !106, size: 64, align: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !7, !7}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !90, file: !89, line: 219, baseType: !7, size: 64, align: 64, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !84, file: !71, line: 237, baseType: !75, size: 32, align: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !84, file: !71, line: 238, baseType: !75, size: 32, align: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !84, file: !71, line: 241, baseType: !113, size: 32, align: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !71, line: 85, baseType: !77)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !84, file: !71, line: 244, baseType: !115, size: 64, align: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !84, file: !71, line: 245, baseType: !115, size: 64, align: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !84, file: !71, line: 246, baseType: !115, size: 64, align: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !84, file: !71, line: 247, baseType: !75, size: 32, align: 32, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !84, file: !71, line: 250, baseType: !115, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !84, file: !71, line: 251, baseType: !73, size: 64, align: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !84, file: !71, line: 252, baseType: !69, size: 64, align: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !84, file: !71, line: 253, baseType: !73, size: 64, align: 64, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !84, file: !71, line: 256, baseType: !75, size: 32, align: 32, offset: 704)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !84, file: !71, line: 259, baseType: !113, size: 32, align: 32, offset: 736)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !84, file: !71, line: 260, baseType: !75, size: 32, align: 32, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !84, file: !71, line: 261, baseType: !75, size: 32, align: 32, offset: 800)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !84, file: !71, line: 261, baseType: !75, size: 32, align: 32, offset: 832)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !84, file: !71, line: 264, baseType: !75, size: 32, align: 32, offset: 864)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !84, file: !71, line: 265, baseType: !75, size: 32, align: 32, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !84, file: !71, line: 266, baseType: !75, size: 32, align: 32, offset: 928)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !84, file: !71, line: 267, baseType: !75, size: 32, align: 32, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !84, file: !71, line: 270, baseType: !75, size: 32, align: 32, offset: 992)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !84, file: !71, line: 271, baseType: !134, size: 2048, align: 8, offset: 1024)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 2048, align: 8, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !84, file: !71, line: 272, baseType: !138, size: 2048, align: 8, offset: 3072)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 2048, align: 8, elements: !135)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !84, file: !71, line: 275, baseType: !113, size: 32, align: 32, offset: 5120)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !84, file: !71, line: 276, baseType: !75, size: 32, align: 32, offset: 5152)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !84, file: !71, line: 279, baseType: !113, size: 32, align: 32, offset: 5184)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !84, file: !71, line: 280, baseType: !113, size: 32, align: 32, offset: 5216)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !84, file: !71, line: 283, baseType: !75, size: 32, align: 32, offset: 5248)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !84, file: !71, line: 284, baseType: !75, size: 32, align: 32, offset: 5280)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !84, file: !71, line: 285, baseType: !75, size: 32, align: 32, offset: 5312)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !84, file: !71, line: 288, baseType: !75, size: 32, align: 32, offset: 5344)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !84, file: !71, line: 289, baseType: !148, size: 8256, align: 32, offset: 5376)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 8256, align: 32, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 258)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !84, file: !71, line: 290, baseType: !152, size: 144016, align: 8, offset: 13632)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 144016, align: 8, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 18002)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !84, file: !71, line: 291, baseType: !152, size: 144016, align: 8, offset: 157648)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !84, file: !71, line: 293, baseType: !157, size: 12384, align: 8, offset: 301664)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 12384, align: 8, elements: !158)
!158 = !{!159, !150}
!159 = !DISubrange(count: 6)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !84, file: !71, line: 294, baseType: !161, size: 49536, align: 32, offset: 314048)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 49536, align: 32, elements: !158)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !84, file: !71, line: 295, baseType: !161, size: 49536, align: 32, offset: 363584)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !84, file: !71, line: 297, baseType: !164, size: 33024, align: 32, offset: 413120)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 33024, align: 32, elements: !165)
!165 = !{!150, !166}
!166 = !DISubrange(count: 4)
!167 = distinct !DISubprogram(name: "fallbackSort", scope: !67, file: !67, line: 259, type: !168, isLocal: true, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !115, !115, !115, !75, !75}
!170 = distinct !DISubprogram(name: "fallbackQSort3", scope: !67, file: !67, line: 140, type: !171, isLocal: true, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !115, !115, !75, !75}
!173 = distinct !DISubprogram(name: "fallbackSimpleSort", scope: !67, file: !67, line: 79, type: !171, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!174 = distinct !DISubprogram(name: "mainSort", scope: !67, file: !67, line: 798, type: !175, isLocal: true, isDefinition: true, scopeLine: 805, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !115, !73, !69, !115, !75, !75, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!178 = distinct !DISubprogram(name: "mainQSort3", scope: !67, file: !67, line: 668, type: !179, isLocal: true, isDefinition: true, scopeLine: 676, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !115, !73, !69, !75, !75, !75, !75, !177}
!181 = distinct !DISubprogram(name: "mainSimpleSort", scope: !67, file: !67, line: 532, type: !179, isLocal: true, isDefinition: true, scopeLine: 540, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!182 = distinct !DISubprogram(name: "mainGtU", scope: !67, file: !67, line: 394, type: !183, isLocal: true, isDefinition: true, scopeLine: 400, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!183 = !DISubroutineType(types: !184)
!184 = !{!76, !113, !113, !73, !69, !113, !177}
!185 = distinct !DISubprogram(name: "mmed3", scope: !67, file: !67, line: 630, type: !186, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!186 = !DISubroutineType(types: !187)
!187 = !{!74, !74, !74, !74}
!188 = !{!189}
!189 = !DIGlobalVariable(name: "incs", scope: !66, file: !67, line: 527, type: !190, isLocal: true, isDefinition: true, variable: [14 x i32]* @incs)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 448, align: 32, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 14)
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !195, subprograms: !199, globals: !250)
!194 = !DIFile(filename: "bzip2.c", directory: "/p-ssd/amoeba/shared/bench/SPEC2006-Install/benchspec/CPU2006/401.bzip2/run/build_base_amd64-m64-clang-nn.0001")
!195 = !{!7, !196, !8, !197, !198, !13}
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !194, line: 261, baseType: !6)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !194, line: 262, baseType: !6)
!199 = !{!200, !203, !206, !209, !221, !224, !227, !231, !234, !239, !240, !243, !244, !245, !246, !247, !248, !249}
!200 = distinct !DISubprogram(name: "compressStream", scope: !194, file: !194, line: 435, type: !201, isLocal: false, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !8, !8}
!203 = distinct !DISubprogram(name: "uncompressStream", scope: !194, file: !194, line: 544, type: !204, isLocal: false, isDefinition: true, scopeLine: 549, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!204 = !DISubroutineType(types: !205)
!205 = !{!196, !8, !8}
!206 = distinct !DISubprogram(name: "myfeof", scope: !194, file: !194, line: 421, type: !207, isLocal: true, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!207 = !DISubroutineType(types: !208)
!208 = !{!196, !8}
!209 = distinct !DISubprogram(name: "uInt64_from_UInt32s", scope: !194, file: !194, line: 340, type: !210, isLocal: true, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212, !220, !220}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt64", file: !194, line: 336, baseType: !214)
!214 = !DICompositeType(tag: DW_TAG_structure_type, file: !194, line: 335, size: 64, align: 8, elements: !215)
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !214, file: !194, line: 335, baseType: !217, size: 64, align: 8)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 64, align: 8, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 8)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !194, line: 264, baseType: !77)
!221 = distinct !DISubprogram(name: "uInt64_to_double", scope: !194, file: !194, line: 354, type: !222, isLocal: true, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!222 = !DISubroutineType(types: !223)
!223 = !{!13, !212}
!224 = distinct !DISubprogram(name: "uInt64_toAscii", scope: !194, file: !194, line: 397, type: !225, isLocal: true, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !23, !212}
!227 = distinct !DISubprogram(name: "uInt64_qrm10", scope: !194, file: !194, line: 379, type: !228, isLocal: true, isDefinition: true, scopeLine: 380, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !212}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !194, line: 263, baseType: !8)
!231 = distinct !DISubprogram(name: "uInt64_isZero", scope: !194, file: !194, line: 368, type: !232, isLocal: true, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!232 = !DISubroutineType(types: !233)
!233 = !{!196, !212}
!234 = distinct !DISubprogram(name: "panic", scope: !194, file: !194, line: 879, type: !235, isLocal: true, isDefinition: true, scopeLine: 880, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !194, line: 260, baseType: !24)
!239 = distinct !DISubprogram(name: "showFileNames", scope: !194, file: !194, line: 805, type: !45, isLocal: true, isDefinition: true, scopeLine: 806, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!240 = distinct !DISubprogram(name: "cleanUpAndFail", scope: !194, file: !194, line: 818, type: !241, isLocal: true, isDefinition: true, scopeLine: 819, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !230}
!243 = distinct !DISubprogram(name: "setExit", scope: !194, file: !194, line: 778, type: !241, isLocal: true, isDefinition: true, scopeLine: 779, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!244 = distinct !DISubprogram(name: "crcError", scope: !194, file: !194, line: 899, type: !45, isLocal: true, isDefinition: true, scopeLine: 900, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!245 = distinct !DISubprogram(name: "cadvise", scope: !194, file: !194, line: 790, type: !45, isLocal: true, isDefinition: true, scopeLine: 791, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!246 = distinct !DISubprogram(name: "compressedStreamEOF", scope: !194, file: !194, line: 912, type: !45, isLocal: true, isDefinition: true, scopeLine: 913, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!247 = distinct !DISubprogram(name: "ioError", scope: !194, file: !194, line: 929, type: !45, isLocal: true, isDefinition: true, scopeLine: 930, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!248 = distinct !DISubprogram(name: "outOfMemory", scope: !194, file: !194, line: 1014, type: !45, isLocal: true, isDefinition: true, scopeLine: 1015, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!249 = distinct !DISubprogram(name: "configError", scope: !194, file: !194, line: 1026, type: !45, isLocal: true, isDefinition: true, scopeLine: 1027, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !270, !271, !272, !273, !274, !275}
!251 = !DIGlobalVariable(name: "verbosity", scope: !193, file: !194, line: 282, type: !230, isLocal: false, isDefinition: true, variable: i32* @verbosity)
!252 = !DIGlobalVariable(name: "keepInputFiles", scope: !193, file: !194, line: 283, type: !196, isLocal: false, isDefinition: true, variable: i8* @keepInputFiles)
!253 = !DIGlobalVariable(name: "smallMode", scope: !193, file: !194, line: 283, type: !196, isLocal: false, isDefinition: true, variable: i8* @smallMode)
!254 = !DIGlobalVariable(name: "deleteOutputOnInterrupt", scope: !193, file: !194, line: 283, type: !196, isLocal: false, isDefinition: true, variable: i8* @deleteOutputOnInterrupt)
!255 = !DIGlobalVariable(name: "forceOverwrite", scope: !193, file: !194, line: 284, type: !196, isLocal: false, isDefinition: true, variable: i8* @forceOverwrite)
!256 = !DIGlobalVariable(name: "testFailsExist", scope: !193, file: !194, line: 284, type: !196, isLocal: false, isDefinition: true, variable: i8* @testFailsExist)
!257 = !DIGlobalVariable(name: "unzFailsExist", scope: !193, file: !194, line: 284, type: !196, isLocal: false, isDefinition: true, variable: i8* @unzFailsExist)
!258 = !DIGlobalVariable(name: "noisy", scope: !193, file: !194, line: 284, type: !196, isLocal: false, isDefinition: true, variable: i8* @noisy)
!259 = !DIGlobalVariable(name: "numFileNames", scope: !193, file: !194, line: 285, type: !230, isLocal: false, isDefinition: true, variable: i32* @numFileNames)
!260 = !DIGlobalVariable(name: "numFilesProcessed", scope: !193, file: !194, line: 285, type: !230, isLocal: false, isDefinition: true, variable: i32* @numFilesProcessed)
!261 = !DIGlobalVariable(name: "blockSize100k", scope: !193, file: !194, line: 285, type: !230, isLocal: false, isDefinition: true, variable: i32* @blockSize100k)
!262 = !DIGlobalVariable(name: "exitValue", scope: !193, file: !194, line: 286, type: !230, isLocal: false, isDefinition: true, variable: i32* @exitValue)
!263 = !DIGlobalVariable(name: "opMode", scope: !193, file: !194, line: 298, type: !230, isLocal: false, isDefinition: true, variable: i32* @opMode)
!264 = !DIGlobalVariable(name: "srcMode", scope: !193, file: !194, line: 299, type: !230, isLocal: false, isDefinition: true, variable: i32* @srcMode)
!265 = !DIGlobalVariable(name: "longestFileName", scope: !193, file: !194, line: 303, type: !230, isLocal: false, isDefinition: true, variable: i32* @longestFileName)
!266 = !DIGlobalVariable(name: "inName", scope: !193, file: !194, line: 304, type: !267, isLocal: false, isDefinition: true, variable: [1034 x i8]* @inName)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 8272, align: 8, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 1034)
!270 = !DIGlobalVariable(name: "outName", scope: !193, file: !194, line: 305, type: !267, isLocal: false, isDefinition: true, variable: [1034 x i8]* @outName)
!271 = !DIGlobalVariable(name: "tmpName", scope: !193, file: !194, line: 306, type: !267, isLocal: false, isDefinition: true, variable: [1034 x i8]* @tmpName)
!272 = !DIGlobalVariable(name: "progName", scope: !193, file: !194, line: 307, type: !237, isLocal: false, isDefinition: true, variable: i8** @progName)
!273 = !DIGlobalVariable(name: "progNameReally", scope: !193, file: !194, line: 308, type: !267, isLocal: false, isDefinition: true, variable: [1034 x i8]* @progNameReally)
!274 = !DIGlobalVariable(name: "outputHandleJustInCase", scope: !193, file: !194, line: 310, type: !8, isLocal: false, isDefinition: true, variable: i32* @outputHandleJustInCase)
!275 = !DIGlobalVariable(name: "workFactor", scope: !193, file: !194, line: 314, type: !230, isLocal: false, isDefinition: true, variable: i32* @workFactor)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !278, retainedTypes: !294, subprograms: !325, globals: !559)
!277 = !DIFile(filename: "bzlib.c", directory: "/p-ssd/amoeba/shared/bench/SPEC2006-Install/benchspec/CPU2006/401.bzip2/run/build_base_amd64-m64-clang-nn.0001")
!278 = !{!279}
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !280, line: 48, size: 32, align: 32, elements: !281)
!280 = !DIFile(filename: "/usr/include/ctype.h", directory: "/p-ssd/amoeba/shared/bench/SPEC2006-Install/benchspec/CPU2006/401.bzip2/run/build_base_amd64-m64-clang-nn.0001")
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293}
!282 = !DIEnumerator(name: "_ISupper", value: 256)
!283 = !DIEnumerator(name: "_ISlower", value: 512)
!284 = !DIEnumerator(name: "_ISalpha", value: 1024)
!285 = !DIEnumerator(name: "_ISdigit", value: 2048)
!286 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!287 = !DIEnumerator(name: "_ISspace", value: 8192)
!288 = !DIEnumerator(name: "_ISprint", value: 16384)
!289 = !DIEnumerator(name: "_ISgraph", value: 32768)
!290 = !DIEnumerator(name: "_ISblank", value: 1)
!291 = !DIEnumerator(name: "_IScntrl", value: 2)
!292 = !DIEnumerator(name: "_ISpunct", value: 4)
!293 = !DIEnumerator(name: "_ISalnum", value: 8)
!294 = !{!7, !73, !69, !115, !76, !8, !295, !5, !113, !74, !75, !72}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "bzFile", file: !277, line: 962, baseType: !297)
!297 = !DICompositeType(tag: DW_TAG_structure_type, file: !277, line: 949, size: 40832, align: 64, elements: !298)
!298 = !{!299, !300, !305, !306, !307, !323, !324}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !297, file: !277, line: 951, baseType: !8, size: 32, align: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !297, file: !277, line: 955, baseType: !301, size: 40000, align: 8, offset: 32)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 40000, align: 8, elements: !303)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !71, line: 81, baseType: !24)
!303 = !{!304}
!304 = !DISubrange(count: 5000)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "bufN", scope: !297, file: !277, line: 956, baseType: !75, size: 32, align: 32, offset: 40032)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "writing", scope: !297, file: !277, line: 957, baseType: !76, size: 8, align: 8, offset: 40064)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !297, file: !277, line: 958, baseType: !308, size: 640, align: 64, offset: 40128)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !89, line: 221, baseType: !309)
!309 = !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 204, size: 640, align: 64, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !309, file: !89, line: 205, baseType: !23, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !309, file: !89, line: 206, baseType: !77, size: 32, align: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !309, file: !89, line: 207, baseType: !77, size: 32, align: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !309, file: !89, line: 208, baseType: !77, size: 32, align: 32, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !309, file: !89, line: 210, baseType: !23, size: 64, align: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !309, file: !89, line: 211, baseType: !77, size: 32, align: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !309, file: !89, line: 212, baseType: !77, size: 32, align: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !309, file: !89, line: 213, baseType: !77, size: 32, align: 32, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !309, file: !89, line: 215, baseType: !7, size: 64, align: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !309, file: !89, line: 217, baseType: !102, size: 64, align: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !309, file: !89, line: 218, baseType: !106, size: 64, align: 64, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !309, file: !89, line: 219, baseType: !7, size: 64, align: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "lastErr", scope: !297, file: !277, line: 959, baseType: !75, size: 32, align: 32, offset: 40768)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "initialisedOk", scope: !297, file: !277, line: 960, baseType: !76, size: 8, align: 8, offset: 40800)
!325 = !{!326, !329, !333, !336, !339, !342, !345, !346, !347, !353, !356, !360, !363, !366, !369, !372, !376, !379, !382, !387, !390, !393, !396, !397, !400, !403, !406, !407, !410, !411, !457, !458, !461, !464, !465, !466, !467, !468, !552, !553, !556}
!326 = distinct !DISubprogram(name: "BZ2_bz__AssertH__fail", scope: !277, file: !277, line: 87, type: !327, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !8}
!329 = distinct !DISubprogram(name: "BZ2_bzCompressInit", scope: !277, file: !277, line: 205, type: !330, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!330 = !DISubroutineType(types: !331)
!331 = !{!8, !332, !8, !8, !8}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!333 = distinct !DISubprogram(name: "BZ2_bzCompress", scope: !277, file: !277, line: 464, type: !334, isLocal: false, isDefinition: true, scopeLine: 465, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!334 = !DISubroutineType(types: !335)
!335 = !{!8, !332, !8}
!336 = distinct !DISubprogram(name: "BZ2_bzCompressEnd", scope: !277, file: !277, line: 525, type: !337, isLocal: false, isDefinition: true, scopeLine: 526, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!337 = !DISubroutineType(types: !338)
!338 = !{!8, !332}
!339 = distinct !DISubprogram(name: "BZ2_bzDecompressInit", scope: !277, file: !277, line: 549, type: !340, isLocal: false, isDefinition: true, scopeLine: 553, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!340 = !DISubroutineType(types: !341)
!341 = !{!8, !332, !8, !8}
!342 = distinct !DISubprogram(name: "BZ2_indexIntoF", scope: !277, file: !277, line: 743, type: !343, isLocal: false, isDefinition: true, scopeLine: 744, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!343 = !DISubroutineType(types: !344)
!344 = !{!75, !75, !177}
!345 = distinct !DISubprogram(name: "BZ2_bzDecompress", scope: !277, file: !277, line: 864, type: !337, isLocal: false, isDefinition: true, scopeLine: 865, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!346 = distinct !DISubprogram(name: "BZ2_bzDecompressEnd", scope: !277, file: !277, line: 918, type: !337, isLocal: false, isDefinition: true, scopeLine: 919, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!347 = distinct !DISubprogram(name: "BZ2_bzWriteOpen", scope: !277, file: !277, line: 980, type: !348, isLocal: false, isDefinition: true, scopeLine: 990, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!348 = !DISubroutineType(types: !349)
!349 = !{!350, !352, !8, !8, !8, !8}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "BZFILE", file: !89, line: 292, baseType: null)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!353 = distinct !DISubprogram(name: "BZ2_bzWrite", scope: !277, file: !277, line: 1032, type: !354, isLocal: false, isDefinition: true, scopeLine: 1037, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !352, !350, !7, !8}
!356 = distinct !DISubprogram(name: "BZ2_bzWriteClose", scope: !277, file: !277, line: 1077, type: !357, isLocal: false, isDefinition: true, scopeLine: 1083, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !352, !350, !8, !359, !359}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!360 = distinct !DISubprogram(name: "BZ2_bzWriteClose64", scope: !277, file: !277, line: 1089, type: !361, isLocal: false, isDefinition: true, scopeLine: 1097, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !352, !350, !8, !359, !359, !359, !359}
!363 = distinct !DISubprogram(name: "BZ2_bzReadOpen", scope: !277, file: !277, line: 1155, type: !364, isLocal: false, isDefinition: true, scopeLine: 1166, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!364 = !DISubroutineType(types: !365)
!365 = !{!350, !352, !8, !8, !8, !7, !8}
!366 = distinct !DISubprogram(name: "BZ2_bzReadClose", scope: !277, file: !277, line: 1215, type: !367, isLocal: false, isDefinition: true, scopeLine: 1216, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !352, !350}
!369 = distinct !DISubprogram(name: "BZ2_bzRead", scope: !277, file: !277, line: 1233, type: !370, isLocal: false, isDefinition: true, scopeLine: 1238, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!370 = !DISubroutineType(types: !371)
!371 = !{!8, !352, !350, !7, !8}
!372 = distinct !DISubprogram(name: "BZ2_bzReadGetUnused", scope: !277, file: !277, line: 1293, type: !373, isLocal: false, isDefinition: true, scopeLine: 1298, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !352, !350, !375, !352}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!376 = distinct !DISubprogram(name: "BZ2_bzBuffToBuffCompress", scope: !277, file: !277, line: 1319, type: !377, isLocal: false, isDefinition: true, scopeLine: 1327, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!377 = !DISubroutineType(types: !378)
!378 = !{!8, !23, !359, !23, !77, !8, !8, !8}
!379 = distinct !DISubprogram(name: "BZ2_bzBuffToBuffDecompress", scope: !277, file: !277, line: 1371, type: !380, isLocal: false, isDefinition: true, scopeLine: 1378, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!380 = !DISubroutineType(types: !381)
!381 = !{!8, !23, !359, !23, !77, !8, !8}
!382 = distinct !DISubprogram(name: "BZ2_bzlibVersion", scope: !277, file: !277, line: 1439, type: !383, isLocal: false, isDefinition: true, scopeLine: 1440, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!383 = !DISubroutineType(types: !384)
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!387 = distinct !DISubprogram(name: "BZ2_bzopen", scope: !277, file: !277, line: 1551, type: !388, isLocal: false, isDefinition: true, scopeLine: 1554, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!388 = !DISubroutineType(types: !389)
!389 = !{!350, !385, !385}
!390 = distinct !DISubprogram(name: "BZ2_bzdopen", scope: !277, file: !277, line: 1560, type: !391, isLocal: false, isDefinition: true, scopeLine: 1563, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!391 = !DISubroutineType(types: !392)
!392 = !{!350, !8, !385}
!393 = distinct !DISubprogram(name: "BZ2_bzread", scope: !277, file: !277, line: 1569, type: !394, isLocal: false, isDefinition: true, scopeLine: 1570, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!394 = !DISubroutineType(types: !395)
!395 = !{!8, !350, !7, !8}
!396 = distinct !DISubprogram(name: "BZ2_bzwrite", scope: !277, file: !277, line: 1583, type: !394, isLocal: false, isDefinition: true, scopeLine: 1584, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!397 = distinct !DISubprogram(name: "BZ2_bzflush", scope: !277, file: !277, line: 1597, type: !398, isLocal: false, isDefinition: true, scopeLine: 1598, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!398 = !DISubroutineType(types: !399)
!399 = !{!8, !350}
!400 = distinct !DISubprogram(name: "BZ2_bzclose", scope: !277, file: !277, line: 1605, type: !401, isLocal: false, isDefinition: true, scopeLine: 1606, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !350}
!403 = distinct !DISubprogram(name: "BZ2_bzerror", scope: !277, file: !277, line: 1657, type: !404, isLocal: false, isDefinition: true, scopeLine: 1658, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!404 = !DISubroutineType(types: !405)
!405 = !{!385, !350, !352}
!406 = distinct !DISubprogram(name: "bz_config_ok", scope: !277, file: !277, line: 148, type: !15, isLocal: true, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!407 = distinct !DISubprogram(name: "default_bzalloc", scope: !277, file: !277, line: 159, type: !408, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!408 = !DISubroutineType(types: !409)
!409 = !{!7, !7, !75, !75}
!410 = distinct !DISubprogram(name: "default_bzfree", scope: !277, file: !277, line: 166, type: !107, isLocal: true, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!411 = distinct !DISubprogram(name: "init_RL", scope: !277, file: !277, line: 188, type: !412, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !71, line: 300, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 231, size: 446144, align: 64, elements: !417)
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !416, file: !71, line: 233, baseType: !332, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !416, file: !71, line: 237, baseType: !75, size: 32, align: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !416, file: !71, line: 238, baseType: !75, size: 32, align: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !416, file: !71, line: 241, baseType: !113, size: 32, align: 32, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !416, file: !71, line: 244, baseType: !115, size: 64, align: 64, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !416, file: !71, line: 245, baseType: !115, size: 64, align: 64, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !416, file: !71, line: 246, baseType: !115, size: 64, align: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !416, file: !71, line: 247, baseType: !75, size: 32, align: 32, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !416, file: !71, line: 250, baseType: !115, size: 64, align: 64, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !416, file: !71, line: 251, baseType: !73, size: 64, align: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !416, file: !71, line: 252, baseType: !69, size: 64, align: 64, offset: 576)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !416, file: !71, line: 253, baseType: !73, size: 64, align: 64, offset: 640)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !416, file: !71, line: 256, baseType: !75, size: 32, align: 32, offset: 704)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !416, file: !71, line: 259, baseType: !113, size: 32, align: 32, offset: 736)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !416, file: !71, line: 260, baseType: !75, size: 32, align: 32, offset: 768)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !416, file: !71, line: 261, baseType: !75, size: 32, align: 32, offset: 800)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !416, file: !71, line: 261, baseType: !75, size: 32, align: 32, offset: 832)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !416, file: !71, line: 264, baseType: !75, size: 32, align: 32, offset: 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !416, file: !71, line: 265, baseType: !75, size: 32, align: 32, offset: 896)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !416, file: !71, line: 266, baseType: !75, size: 32, align: 32, offset: 928)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !416, file: !71, line: 267, baseType: !75, size: 32, align: 32, offset: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !416, file: !71, line: 270, baseType: !75, size: 32, align: 32, offset: 992)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !416, file: !71, line: 271, baseType: !134, size: 2048, align: 8, offset: 1024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !416, file: !71, line: 272, baseType: !138, size: 2048, align: 8, offset: 3072)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !416, file: !71, line: 275, baseType: !113, size: 32, align: 32, offset: 5120)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !416, file: !71, line: 276, baseType: !75, size: 32, align: 32, offset: 5152)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !416, file: !71, line: 279, baseType: !113, size: 32, align: 32, offset: 5184)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !416, file: !71, line: 280, baseType: !113, size: 32, align: 32, offset: 5216)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !416, file: !71, line: 283, baseType: !75, size: 32, align: 32, offset: 5248)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !416, file: !71, line: 284, baseType: !75, size: 32, align: 32, offset: 5280)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !416, file: !71, line: 285, baseType: !75, size: 32, align: 32, offset: 5312)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !416, file: !71, line: 288, baseType: !75, size: 32, align: 32, offset: 5344)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !416, file: !71, line: 289, baseType: !148, size: 8256, align: 32, offset: 5376)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !416, file: !71, line: 290, baseType: !152, size: 144016, align: 8, offset: 13632)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !416, file: !71, line: 291, baseType: !152, size: 144016, align: 8, offset: 157648)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !416, file: !71, line: 293, baseType: !157, size: 12384, align: 8, offset: 301664)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !416, file: !71, line: 294, baseType: !161, size: 49536, align: 32, offset: 314048)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !416, file: !71, line: 295, baseType: !161, size: 49536, align: 32, offset: 363584)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !416, file: !71, line: 297, baseType: !164, size: 33024, align: 32, offset: 413120)
!457 = distinct !DISubprogram(name: "prepare_new_block", scope: !277, file: !277, line: 174, type: !412, isLocal: true, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!458 = distinct !DISubprogram(name: "handle_compress", scope: !277, file: !277, line: 418, type: !459, isLocal: true, isDefinition: true, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!459 = !DISubroutineType(types: !460)
!460 = !{!76, !332}
!461 = distinct !DISubprogram(name: "copy_output_until_stop", scope: !277, file: !277, line: 391, type: !462, isLocal: true, isDefinition: true, scopeLine: 392, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!462 = !DISubroutineType(types: !463)
!463 = !{!76, !414}
!464 = distinct !DISubprogram(name: "copy_input_until_stop", scope: !277, file: !277, line: 346, type: !462, isLocal: true, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!465 = distinct !DISubprogram(name: "add_pair_to_block", scope: !277, file: !277, line: 273, type: !412, isLocal: true, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!466 = distinct !DISubprogram(name: "flush_RL", scope: !277, file: !277, line: 309, type: !412, isLocal: true, isDefinition: true, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!467 = distinct !DISubprogram(name: "isempty_RL", scope: !277, file: !277, line: 196, type: !462, isLocal: true, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!468 = distinct !DISubprogram(name: "unRLE_obuf_to_output_SMALL", scope: !277, file: !277, line: 762, type: !469, isLocal: true, isDefinition: true, scopeLine: 763, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!469 = !DISubroutineType(types: !470)
!470 = !{!76, !471}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "DState", file: !71, line: 472, baseType: !473)
!473 = !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 382, size: 513152, align: 64, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !493, !494, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !512, !513, !517, !519, !520, !521, !522, !523, !524, !525, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !473, file: !71, line: 384, baseType: !332, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !473, file: !71, line: 387, baseType: !75, size: 32, align: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_ch", scope: !473, file: !71, line: 390, baseType: !74, size: 8, align: 8, offset: 96)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_len", scope: !473, file: !71, line: 391, baseType: !75, size: 32, align: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "blockRandomised", scope: !473, file: !71, line: 392, baseType: !76, size: 8, align: 8, offset: 160)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !473, file: !71, line: 393, baseType: !75, size: 32, align: 32, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !473, file: !71, line: 393, baseType: !75, size: 32, align: 32, offset: 224)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !473, file: !71, line: 396, baseType: !113, size: 32, align: 32, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !473, file: !71, line: 397, baseType: !75, size: 32, align: 32, offset: 288)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !473, file: !71, line: 400, baseType: !75, size: 32, align: 32, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "smallDecompress", scope: !473, file: !71, line: 401, baseType: !76, size: 8, align: 8, offset: 352)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "currBlockNo", scope: !473, file: !71, line: 402, baseType: !75, size: 32, align: 32, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !473, file: !71, line: 403, baseType: !75, size: 32, align: 32, offset: 416)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !473, file: !71, line: 406, baseType: !75, size: 32, align: 32, offset: 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tPos", scope: !473, file: !71, line: 407, baseType: !113, size: 32, align: 32, offset: 480)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "k0", scope: !473, file: !71, line: 408, baseType: !75, size: 32, align: 32, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "unzftab", scope: !473, file: !71, line: 409, baseType: !492, size: 8192, align: 32, offset: 544)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 8192, align: 32, elements: !135)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nblock_used", scope: !473, file: !71, line: 410, baseType: !75, size: 32, align: 32, offset: 8736)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "cftab", scope: !473, file: !71, line: 411, baseType: !495, size: 8224, align: 32, offset: 8768)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 8224, align: 32, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 257)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "cftabCopy", scope: !473, file: !71, line: 412, baseType: !495, size: 8224, align: 32, offset: 16992)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !473, file: !71, line: 415, baseType: !115, size: 64, align: 64, offset: 25216)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ll16", scope: !473, file: !71, line: 418, baseType: !69, size: 64, align: 64, offset: 25280)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ll4", scope: !473, file: !71, line: 419, baseType: !73, size: 64, align: 64, offset: 25344)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "storedBlockCRC", scope: !473, file: !71, line: 422, baseType: !113, size: 32, align: 32, offset: 25408)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "storedCombinedCRC", scope: !473, file: !71, line: 423, baseType: !113, size: 32, align: 32, offset: 25440)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "calculatedBlockCRC", scope: !473, file: !71, line: 424, baseType: !113, size: 32, align: 32, offset: 25472)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "calculatedCombinedCRC", scope: !473, file: !71, line: 425, baseType: !113, size: 32, align: 32, offset: 25504)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !473, file: !71, line: 428, baseType: !75, size: 32, align: 32, offset: 25536)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !473, file: !71, line: 429, baseType: !134, size: 2048, align: 8, offset: 25568)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "inUse16", scope: !473, file: !71, line: 430, baseType: !509, size: 128, align: 8, offset: 27616)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 128, align: 8, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 16)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "seqToUnseq", scope: !473, file: !71, line: 431, baseType: !138, size: 2048, align: 8, offset: 27744)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mtfa", scope: !473, file: !71, line: 434, baseType: !514, size: 32768, align: 8, offset: 29792)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32768, align: 8, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 4096)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mtfbase", scope: !473, file: !71, line: 435, baseType: !518, size: 512, align: 32, offset: 62560)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 512, align: 32, elements: !510)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !473, file: !71, line: 436, baseType: !152, size: 144016, align: 8, offset: 63072)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !473, file: !71, line: 437, baseType: !152, size: 144016, align: 8, offset: 207088)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !473, file: !71, line: 438, baseType: !157, size: 12384, align: 8, offset: 351104)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !473, file: !71, line: 440, baseType: !161, size: 49536, align: 32, offset: 363488)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !473, file: !71, line: 441, baseType: !161, size: 49536, align: 32, offset: 413024)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !473, file: !71, line: 442, baseType: !161, size: 49536, align: 32, offset: 462560)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "minLens", scope: !473, file: !71, line: 443, baseType: !526, size: 192, align: 32, offset: 512096)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 192, align: 32, elements: !527)
!527 = !{!159}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "save_i", scope: !473, file: !71, line: 446, baseType: !75, size: 32, align: 32, offset: 512288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "save_j", scope: !473, file: !71, line: 447, baseType: !75, size: 32, align: 32, offset: 512320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "save_t", scope: !473, file: !71, line: 448, baseType: !75, size: 32, align: 32, offset: 512352)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "save_alphaSize", scope: !473, file: !71, line: 449, baseType: !75, size: 32, align: 32, offset: 512384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "save_nGroups", scope: !473, file: !71, line: 450, baseType: !75, size: 32, align: 32, offset: 512416)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "save_nSelectors", scope: !473, file: !71, line: 451, baseType: !75, size: 32, align: 32, offset: 512448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "save_EOB", scope: !473, file: !71, line: 452, baseType: !75, size: 32, align: 32, offset: 512480)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "save_groupNo", scope: !473, file: !71, line: 453, baseType: !75, size: 32, align: 32, offset: 512512)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "save_groupPos", scope: !473, file: !71, line: 454, baseType: !75, size: 32, align: 32, offset: 512544)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "save_nextSym", scope: !473, file: !71, line: 455, baseType: !75, size: 32, align: 32, offset: 512576)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "save_nblockMAX", scope: !473, file: !71, line: 456, baseType: !75, size: 32, align: 32, offset: 512608)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "save_nblock", scope: !473, file: !71, line: 457, baseType: !75, size: 32, align: 32, offset: 512640)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "save_es", scope: !473, file: !71, line: 458, baseType: !75, size: 32, align: 32, offset: 512672)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "save_N", scope: !473, file: !71, line: 459, baseType: !75, size: 32, align: 32, offset: 512704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "save_curr", scope: !473, file: !71, line: 460, baseType: !75, size: 32, align: 32, offset: 512736)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "save_zt", scope: !473, file: !71, line: 461, baseType: !75, size: 32, align: 32, offset: 512768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "save_zn", scope: !473, file: !71, line: 462, baseType: !75, size: 32, align: 32, offset: 512800)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "save_zvec", scope: !473, file: !71, line: 463, baseType: !75, size: 32, align: 32, offset: 512832)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "save_zj", scope: !473, file: !71, line: 464, baseType: !75, size: 32, align: 32, offset: 512864)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "save_gSel", scope: !473, file: !71, line: 465, baseType: !75, size: 32, align: 32, offset: 512896)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "save_gMinlen", scope: !473, file: !71, line: 466, baseType: !75, size: 32, align: 32, offset: 512928)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "save_gLimit", scope: !473, file: !71, line: 467, baseType: !177, size: 64, align: 64, offset: 512960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "save_gBase", scope: !473, file: !71, line: 468, baseType: !177, size: 64, align: 64, offset: 513024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "save_gPerm", scope: !473, file: !71, line: 469, baseType: !177, size: 64, align: 64, offset: 513088)
!552 = distinct !DISubprogram(name: "unRLE_obuf_to_output_FAST", scope: !277, file: !277, line: 593, type: !469, isLocal: true, isDefinition: true, scopeLine: 594, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!553 = distinct !DISubprogram(name: "myfeof", scope: !277, file: !277, line: 967, type: !554, isLocal: true, isDefinition: true, scopeLine: 971, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!554 = !DISubroutineType(types: !555)
!555 = !{!76, !8}
!556 = distinct !DISubprogram(name: "bzopen_or_bzdopen", scope: !277, file: !277, line: 1458, type: !557, isLocal: true, isDefinition: true, scopeLine: 1463, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!557 = !DISubroutineType(types: !558)
!558 = !{!350, !385, !8, !385, !8}
!559 = !{!560}
!560 = !DIGlobalVariable(name: "bzerrorstrings", scope: !276, file: !277, line: 1637, type: !561, isLocal: true, isDefinition: true, variable: [16 x i8*]* @bzerrorstrings)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1024, align: 64, elements: !510)
!562 = distinct !DICompileUnit(language: DW_LANG_C99, file: !563, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !564, subprograms: !565)
!563 = !DIFile(filename: "compress.c", directory: "/p-ssd/amoeba/shared/bench/SPEC2006-Install/benchspec/CPU2006/401.bzip2/run/build_base_amd64-m64-clang-nn.0001")
!564 = !{!73, !74, !113, !76, !4}
!565 = !{!566, !628, !631, !634, !637, !640, !641, !642, !643}
!566 = distinct !DISubprogram(name: "BZ2_bsInitWrite", scope: !563, file: !563, line: 81, type: !567, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !71, line: 300, baseType: !571)
!571 = !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 231, size: 446144, align: 64, elements: !572)
!572 = !{!573, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !571, file: !71, line: 233, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !89, line: 221, baseType: !576)
!576 = !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 204, size: 640, align: 64, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !576, file: !89, line: 205, baseType: !23, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !576, file: !89, line: 206, baseType: !77, size: 32, align: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !576, file: !89, line: 207, baseType: !77, size: 32, align: 32, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !576, file: !89, line: 208, baseType: !77, size: 32, align: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !576, file: !89, line: 210, baseType: !23, size: 64, align: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !576, file: !89, line: 211, baseType: !77, size: 32, align: 32, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !576, file: !89, line: 212, baseType: !77, size: 32, align: 32, offset: 288)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !576, file: !89, line: 213, baseType: !77, size: 32, align: 32, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !576, file: !89, line: 215, baseType: !7, size: 64, align: 64, offset: 384)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !576, file: !89, line: 217, baseType: !102, size: 64, align: 64, offset: 448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !576, file: !89, line: 218, baseType: !106, size: 64, align: 64, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !576, file: !89, line: 219, baseType: !7, size: 64, align: 64, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !571, file: !71, line: 237, baseType: !75, size: 32, align: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !571, file: !71, line: 238, baseType: !75, size: 32, align: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !571, file: !71, line: 241, baseType: !113, size: 32, align: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !571, file: !71, line: 244, baseType: !115, size: 64, align: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !571, file: !71, line: 245, baseType: !115, size: 64, align: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !571, file: !71, line: 246, baseType: !115, size: 64, align: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !571, file: !71, line: 247, baseType: !75, size: 32, align: 32, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !571, file: !71, line: 250, baseType: !115, size: 64, align: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !571, file: !71, line: 251, baseType: !73, size: 64, align: 64, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !571, file: !71, line: 252, baseType: !69, size: 64, align: 64, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !571, file: !71, line: 253, baseType: !73, size: 64, align: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !571, file: !71, line: 256, baseType: !75, size: 32, align: 32, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !571, file: !71, line: 259, baseType: !113, size: 32, align: 32, offset: 736)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !571, file: !71, line: 260, baseType: !75, size: 32, align: 32, offset: 768)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !571, file: !71, line: 261, baseType: !75, size: 32, align: 32, offset: 800)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !571, file: !71, line: 261, baseType: !75, size: 32, align: 32, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !571, file: !71, line: 264, baseType: !75, size: 32, align: 32, offset: 864)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !571, file: !71, line: 265, baseType: !75, size: 32, align: 32, offset: 896)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !571, file: !71, line: 266, baseType: !75, size: 32, align: 32, offset: 928)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !571, file: !71, line: 267, baseType: !75, size: 32, align: 32, offset: 960)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !571, file: !71, line: 270, baseType: !75, size: 32, align: 32, offset: 992)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !571, file: !71, line: 271, baseType: !134, size: 2048, align: 8, offset: 1024)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !571, file: !71, line: 272, baseType: !138, size: 2048, align: 8, offset: 3072)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !571, file: !71, line: 275, baseType: !113, size: 32, align: 32, offset: 5120)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !571, file: !71, line: 276, baseType: !75, size: 32, align: 32, offset: 5152)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !571, file: !71, line: 279, baseType: !113, size: 32, align: 32, offset: 5184)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !571, file: !71, line: 280, baseType: !113, size: 32, align: 32, offset: 5216)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !571, file: !71, line: 283, baseType: !75, size: 32, align: 32, offset: 5248)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !571, file: !71, line: 284, baseType: !75, size: 32, align: 32, offset: 5280)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !571, file: !71, line: 285, baseType: !75, size: 32, align: 32, offset: 5312)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !571, file: !71, line: 288, baseType: !75, size: 32, align: 32, offset: 5344)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !571, file: !71, line: 289, baseType: !148, size: 8256, align: 32, offset: 5376)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !571, file: !71, line: 290, baseType: !152, size: 144016, align: 8, offset: 13632)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !571, file: !71, line: 291, baseType: !152, size: 144016, align: 8, offset: 157648)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !571, file: !71, line: 293, baseType: !157, size: 12384, align: 8, offset: 301664)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !571, file: !71, line: 294, baseType: !161, size: 49536, align: 32, offset: 314048)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !571, file: !71, line: 295, baseType: !161, size: 49536, align: 32, offset: 363584)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !571, file: !71, line: 297, baseType: !164, size: 33024, align: 32, offset: 413120)
!628 = distinct !DISubprogram(name: "BZ2_compressBlock", scope: !563, file: !563, line: 646, type: !629, isLocal: false, isDefinition: true, scopeLine: 647, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !569, !76}
!631 = distinct !DISubprogram(name: "bsPutUChar", scope: !563, file: !563, line: 138, type: !632, isLocal: true, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !569, !74}
!634 = distinct !DISubprogram(name: "bsPutUInt32", scope: !563, file: !563, line: 127, type: !635, isLocal: true, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !569, !113}
!637 = distinct !DISubprogram(name: "bsW", scope: !563, file: !563, line: 117, type: !638, isLocal: true, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !569, !75, !113}
!640 = distinct !DISubprogram(name: "generateMTFValues", scope: !563, file: !563, line: 164, type: !567, isLocal: true, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!641 = distinct !DISubprogram(name: "makeMaps_e", scope: !563, file: !563, line: 150, type: !567, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!642 = distinct !DISubprogram(name: "sendMTFValues", scope: !563, file: !563, line: 283, type: !567, isLocal: true, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!643 = distinct !DISubprogram(name: "bsFinishWrite", scope: !563, file: !563, line: 90, type: !567, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!644 = distinct !DICompileUnit(language: DW_LANG_C99, file: !645, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, globals: !646)
!645 = !DIFile(filename: "crctable.c", directory: "/p-ssd/amoeba/shared/bench/SPEC2006-Install/benchspec/CPU2006/401.bzip2/run/build_base_amd64-m64-clang-nn.0001")
!646 = !{!647}
!647 = !DIGlobalVariable(name: "BZ2_crc32Table", scope: !644, file: !645, line: 71, type: !648, isLocal: false, isDefinition: true, variable: [256 x i32]* @BZ2_crc32Table)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 8192, align: 32, elements: !135)
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !651, subprograms: !652)
!650 = !DIFile(filename: "decompress.c", directory: "/p-ssd/amoeba/shared/bench/SPEC2006-Install/benchspec/CPU2006/401.bzip2/run/build_base_amd64-m64-clang-nn.0001")
!651 = !{!76, !113, !73, !7, !75, !74, !70}
!652 = !{!653, !740}
!653 = distinct !DISubprogram(name: "BZ2_decompress", scope: !650, file: !650, line: 146, type: !654, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!654 = !DISubroutineType(types: !655)
!655 = !{!75, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "DState", file: !71, line: 472, baseType: !658)
!658 = !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 382, size: 513152, align: 64, elements: !659)
!659 = !{!660, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !658, file: !71, line: 384, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !89, line: 221, baseType: !663)
!663 = !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 204, size: 640, align: 64, elements: !664)
!664 = !{!665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !663, file: !89, line: 205, baseType: !23, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !663, file: !89, line: 206, baseType: !77, size: 32, align: 32, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !663, file: !89, line: 207, baseType: !77, size: 32, align: 32, offset: 96)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !663, file: !89, line: 208, baseType: !77, size: 32, align: 32, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !663, file: !89, line: 210, baseType: !23, size: 64, align: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !663, file: !89, line: 211, baseType: !77, size: 32, align: 32, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !663, file: !89, line: 212, baseType: !77, size: 32, align: 32, offset: 288)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !663, file: !89, line: 213, baseType: !77, size: 32, align: 32, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !663, file: !89, line: 215, baseType: !7, size: 64, align: 64, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !663, file: !89, line: 217, baseType: !102, size: 64, align: 64, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !663, file: !89, line: 218, baseType: !106, size: 64, align: 64, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !663, file: !89, line: 219, baseType: !7, size: 64, align: 64, offset: 576)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !658, file: !71, line: 387, baseType: !75, size: 32, align: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_ch", scope: !658, file: !71, line: 390, baseType: !74, size: 8, align: 8, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_len", scope: !658, file: !71, line: 391, baseType: !75, size: 32, align: 32, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "blockRandomised", scope: !658, file: !71, line: 392, baseType: !76, size: 8, align: 8, offset: 160)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !658, file: !71, line: 393, baseType: !75, size: 32, align: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !658, file: !71, line: 393, baseType: !75, size: 32, align: 32, offset: 224)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !658, file: !71, line: 396, baseType: !113, size: 32, align: 32, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !658, file: !71, line: 397, baseType: !75, size: 32, align: 32, offset: 288)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !658, file: !71, line: 400, baseType: !75, size: 32, align: 32, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "smallDecompress", scope: !658, file: !71, line: 401, baseType: !76, size: 8, align: 8, offset: 352)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "currBlockNo", scope: !658, file: !71, line: 402, baseType: !75, size: 32, align: 32, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !658, file: !71, line: 403, baseType: !75, size: 32, align: 32, offset: 416)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !658, file: !71, line: 406, baseType: !75, size: 32, align: 32, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tPos", scope: !658, file: !71, line: 407, baseType: !113, size: 32, align: 32, offset: 480)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "k0", scope: !658, file: !71, line: 408, baseType: !75, size: 32, align: 32, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "unzftab", scope: !658, file: !71, line: 409, baseType: !492, size: 8192, align: 32, offset: 544)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "nblock_used", scope: !658, file: !71, line: 410, baseType: !75, size: 32, align: 32, offset: 8736)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "cftab", scope: !658, file: !71, line: 411, baseType: !495, size: 8224, align: 32, offset: 8768)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cftabCopy", scope: !658, file: !71, line: 412, baseType: !495, size: 8224, align: 32, offset: 16992)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !658, file: !71, line: 415, baseType: !115, size: 64, align: 64, offset: 25216)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ll16", scope: !658, file: !71, line: 418, baseType: !69, size: 64, align: 64, offset: 25280)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ll4", scope: !658, file: !71, line: 419, baseType: !73, size: 64, align: 64, offset: 25344)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "storedBlockCRC", scope: !658, file: !71, line: 422, baseType: !113, size: 32, align: 32, offset: 25408)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "storedCombinedCRC", scope: !658, file: !71, line: 423, baseType: !113, size: 32, align: 32, offset: 25440)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "calculatedBlockCRC", scope: !658, file: !71, line: 424, baseType: !113, size: 32, align: 32, offset: 25472)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "calculatedCombinedCRC", scope: !658, file: !71, line: 425, baseType: !113, size: 32, align: 32, offset: 25504)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !658, file: !71, line: 428, baseType: !75, size: 32, align: 32, offset: 25536)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !658, file: !71, line: 429, baseType: !134, size: 2048, align: 8, offset: 25568)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "inUse16", scope: !658, file: !71, line: 430, baseType: !509, size: 128, align: 8, offset: 27616)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "seqToUnseq", scope: !658, file: !71, line: 431, baseType: !138, size: 2048, align: 8, offset: 27744)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mtfa", scope: !658, file: !71, line: 434, baseType: !514, size: 32768, align: 8, offset: 29792)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mtfbase", scope: !658, file: !71, line: 435, baseType: !518, size: 512, align: 32, offset: 62560)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !658, file: !71, line: 436, baseType: !152, size: 144016, align: 8, offset: 63072)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !658, file: !71, line: 437, baseType: !152, size: 144016, align: 8, offset: 207088)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !658, file: !71, line: 438, baseType: !157, size: 12384, align: 8, offset: 351104)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !658, file: !71, line: 440, baseType: !161, size: 49536, align: 32, offset: 363488)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !658, file: !71, line: 441, baseType: !161, size: 49536, align: 32, offset: 413024)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !658, file: !71, line: 442, baseType: !161, size: 49536, align: 32, offset: 462560)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "minLens", scope: !658, file: !71, line: 443, baseType: !526, size: 192, align: 32, offset: 512096)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "save_i", scope: !658, file: !71, line: 446, baseType: !75, size: 32, align: 32, offset: 512288)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "save_j", scope: !658, file: !71, line: 447, baseType: !75, size: 32, align: 32, offset: 512320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "save_t", scope: !658, file: !71, line: 448, baseType: !75, size: 32, align: 32, offset: 512352)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "save_alphaSize", scope: !658, file: !71, line: 449, baseType: !75, size: 32, align: 32, offset: 512384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "save_nGroups", scope: !658, file: !71, line: 450, baseType: !75, size: 32, align: 32, offset: 512416)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "save_nSelectors", scope: !658, file: !71, line: 451, baseType: !75, size: 32, align: 32, offset: 512448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "save_EOB", scope: !658, file: !71, line: 452, baseType: !75, size: 32, align: 32, offset: 512480)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "save_groupNo", scope: !658, file: !71, line: 453, baseType: !75, size: 32, align: 32, offset: 512512)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "save_groupPos", scope: !658, file: !71, line: 454, baseType: !75, size: 32, align: 32, offset: 512544)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "save_nextSym", scope: !658, file: !71, line: 455, baseType: !75, size: 32, align: 32, offset: 512576)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "save_nblockMAX", scope: !658, file: !71, line: 456, baseType: !75, size: 32, align: 32, offset: 512608)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "save_nblock", scope: !658, file: !71, line: 457, baseType: !75, size: 32, align: 32, offset: 512640)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "save_es", scope: !658, file: !71, line: 458, baseType: !75, size: 32, align: 32, offset: 512672)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "save_N", scope: !658, file: !71, line: 459, baseType: !75, size: 32, align: 32, offset: 512704)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "save_curr", scope: !658, file: !71, line: 460, baseType: !75, size: 32, align: 32, offset: 512736)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "save_zt", scope: !658, file: !71, line: 461, baseType: !75, size: 32, align: 32, offset: 512768)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "save_zn", scope: !658, file: !71, line: 462, baseType: !75, size: 32, align: 32, offset: 512800)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "save_zvec", scope: !658, file: !71, line: 463, baseType: !75, size: 32, align: 32, offset: 512832)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "save_zj", scope: !658, file: !71, line: 464, baseType: !75, size: 32, align: 32, offset: 512864)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "save_gSel", scope: !658, file: !71, line: 465, baseType: !75, size: 32, align: 32, offset: 512896)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "save_gMinlen", scope: !658, file: !71, line: 466, baseType: !75, size: 32, align: 32, offset: 512928)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "save_gLimit", scope: !658, file: !71, line: 467, baseType: !177, size: 64, align: 64, offset: 512960)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "save_gBase", scope: !658, file: !71, line: 468, baseType: !177, size: 64, align: 64, offset: 513024)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "save_gPerm", scope: !658, file: !71, line: 469, baseType: !177, size: 64, align: 64, offset: 513088)
!740 = distinct !DISubprogram(name: "makeMaps_d", scope: !650, file: !650, line: 67, type: !741, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !656}
!743 = distinct !DICompileUnit(language: DW_LANG_C99, file: !744, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !745, subprograms: !746)
!744 = !DIFile(filename: "huffman.c", directory: "/p-ssd/amoeba/shared/bench/SPEC2006-Install/benchspec/CPU2006/401.bzip2/run/build_base_amd64-m64-clang-nn.0001")
!745 = !{!76}
!746 = !{!747, !750, !753}
!747 = distinct !DISubprogram(name: "BZ2_hbMakeCodeLengths", scope: !744, file: !744, line: 103, type: !748, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !73, !177, !75, !75}
!750 = distinct !DISubprogram(name: "BZ2_hbAssignCodes", scope: !744, file: !744, line: 192, type: !751, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !177, !73, !75, !75, !75}
!753 = distinct !DISubprogram(name: "BZ2_hbCreateDecodeTables", scope: !744, file: !744, line: 210, type: !754, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !177, !177, !177, !73, !75, !75, !75}
!756 = distinct !DICompileUnit(language: DW_LANG_C99, file: !757, producer: "clang version 3.8.0 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, globals: !758)
!757 = !DIFile(filename: "randtable.c", directory: "/p-ssd/amoeba/shared/bench/SPEC2006-Install/benchspec/CPU2006/401.bzip2/run/build_base_amd64-m64-clang-nn.0001")
!758 = !{!759}
!759 = !DIGlobalVariable(name: "BZ2_rNums", scope: !756, file: !757, line: 66, type: !760, isLocal: false, isDefinition: true, variable: [512 x i32]* @BZ2_rNums)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 16384, align: 32, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 512)
!763 = !{!"clang version 3.8.0 (tags/RELEASE_380/final)"}
!764 = !{i32 2, !"Dwarf Version", i32 4}
!765 = !{i32 2, !"Debug Info Version", i32 3}
!766 = !DILocalVariable(name: "lo", scope: !10, file: !1, line: 64, type: !65)
!767 = !DIExpression()
!768 = !DILocation(line: 64, column: 7, scope: !10)
!769 = !DILocalVariable(name: "hi", scope: !10, file: !1, line: 65, type: !65)
!770 = !DILocation(line: 65, column: 7, scope: !10)
!771 = !DILocalVariable(name: "test", scope: !10, file: !1, line: 66, type: !65)
!772 = !DILocation(line: 66, column: 7, scope: !10)
!773 = !DILocation(line: 68, column: 7, scope: !10)
!774 = !DILocation(line: 68, column: 13, scope: !10)
!775 = !DILocation(line: 68, column: 5, scope: !10)
!776 = !DILocation(line: 69, column: 7, scope: !10)
!777 = !DILocation(line: 69, column: 13, scope: !10)
!778 = !DILocation(line: 69, column: 5, scope: !10)
!779 = !DILocation(line: 70, column: 25, scope: !10)
!780 = !DILocation(line: 70, column: 23, scope: !10)
!781 = !DILocation(line: 70, column: 45, scope: !10)
!782 = !DILocation(line: 70, column: 43, scope: !10)
!783 = !DILocation(line: 70, column: 28, scope: !10)
!784 = !DILocation(line: 70, column: 7, scope: !10)
!785 = !DILocation(line: 71, column: 6, scope: !786)
!786 = distinct !DILexicalBlock(scope: !10, file: !1, line: 71, column: 6)
!787 = !DILocation(line: 71, column: 11, scope: !786)
!788 = !DILocation(line: 71, column: 6, scope: !10)
!789 = !DILocation(line: 72, column: 11, scope: !790)
!790 = distinct !DILexicalBlock(scope: !786, file: !1, line: 71, column: 16)
